In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764
2013-01-04  1.019432 -1.098247 -0.541578  1.987401
2013-01-05  2.173010  1.169701 -0.644824  0.222861
2013-01-06 -0.371800  0.293145  1.984087  0.542316

In [5]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764

In [6]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.values

array([[-0.53514287,  1.01878938, -0.76562563,  0.65664017],
       [-0.35448547, -0.33807591,  0.86123832,  0.22068143],
       [-0.6753976 ,  0.06716479,  0.54505212, -0.57276397],
       [ 1.01943161, -1.09824711, -0.54157827,  1.98740097],
       [ 2.17300994,  1.1697011 , -0.64482402,  0.22286126],
       [-0.37179971,  0.29314485,  1.98408704,  0.54231635]])

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.209269  0.185413  0.239725  0.509523
std    1.140604  0.849794  1.088659  0.841878
min   -0.675398 -1.098247 -0.765626 -0.572764
25%   -0.494307 -0.236766 -0.619013  0.221226
50%   -0.363143  0.180155  0.001737  0.382589
75%    0.675952  0.837378  0.782192  0.628059
max    2.173010  1.169701  1.984087  1.987401

In [11]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-05  2.173010  1.169701 -0.644824  0.222861
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-06 -0.371800  0.293145  1.984087  0.542316
2013-01-03 -0.675398  0.067165  0.545052 -0.572764
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-04  1.019432 -1.098247 -0.541578  1.987401

In [12]:
df

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764
2013-01-04  1.019432 -1.098247 -0.541578  1.987401
2013-01-05  2.173010  1.169701 -0.644824  0.222861
2013-01-06 -0.371800  0.293145  1.984087  0.542316

In [14]:
df['A']

2013-01-01   -0.535143
2013-01-02   -0.354485
2013-01-03   -0.675398
2013-01-04    1.019432
2013-01-05    2.173010
2013-01-06   -0.371800
Freq: D, Name: A, dtype: float64

In [15]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764

In [16]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764
2013-01-04  1.019432 -1.098247 -0.541578  1.987401

In [17]:
df[1:3]

                   A         B         C         D
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764

In [23]:
df.loc[dates[0]]

A   -0.535143
B    1.018789
C   -0.765626
D    0.656640
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.535143  1.018789
2013-01-02 -0.354485 -0.338076
2013-01-03 -0.675398  0.067165
2013-01-04  1.019432 -1.098247
2013-01-05  2.173010  1.169701
2013-01-06 -0.371800  0.293145

In [27]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.354485 -0.338076
2013-01-03 -0.675398  0.067165
2013-01-04  1.019432 -1.098247

In [28]:
df.loc['20130102',['A','B']]

A   -0.354485
B   -0.338076
Name: 2013-01-02 00:00:00, dtype: float64

In [29]:
df.loc[dates[0],'A']

-0.5351428664322813

In [30]:
df.loc[dates[1:4],['A','B']]

                   A         B
2013-01-02 -0.354485 -0.338076
2013-01-03 -0.675398  0.067165
2013-01-04  1.019432 -1.098247

In [31]:
df.iloc[3]

A    1.019432
B   -1.098247
C   -0.541578
D    1.987401
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.019432 -1.098247
2013-01-05  2.173010  1.169701

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.354485  0.861238
2013-01-03 -0.675398  0.545052
2013-01-05  2.173010 -0.644824

In [34]:
df[df.A>0]

                   A         B         C         D
2013-01-04  1.019432 -1.098247 -0.541578  1.987401
2013-01-05  2.173010  1.169701 -0.644824  0.222861

In [35]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  1.018789       NaN  0.656640
2013-01-02       NaN       NaN  0.861238  0.220681
2013-01-03       NaN  0.067165  0.545052       NaN
2013-01-04  1.019432       NaN       NaN  1.987401
2013-01-05  2.173010  1.169701       NaN  0.222861
2013-01-06       NaN  0.293145  1.984087  0.542316

In [36]:
df2 = df.copy()

In [37]:
df2

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764
2013-01-04  1.019432 -1.098247 -0.541578  1.987401
2013-01-05  2.173010  1.169701 -0.644824  0.222861
2013-01-06 -0.371800  0.293145  1.984087  0.542316

In [38]:
df3=df
df3

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764
2013-01-04  1.019432 -1.098247 -0.541578  1.987401
2013-01-05  2.173010  1.169701 -0.644824  0.222861
2013-01-06 -0.371800  0.293145  1.984087  0.542316

In [40]:
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.535143  1.018789 -0.765626  0.656640    one
2013-01-02 -0.354485 -0.338076  0.861238  0.220681    one
2013-01-03 -0.675398  0.067165  0.545052 -0.572764    two
2013-01-04  1.019432 -1.098247 -0.541578  1.987401  three
2013-01-05  2.173010  1.169701 -0.644824  0.222861   four
2013-01-06 -0.371800  0.293145  1.984087  0.542316  three

In [43]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [44]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.675398  0.067165  0.545052 -0.572764   two
2013-01-05  2.173010  1.169701 -0.644824  0.222861  four

In [45]:
df

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.354485 -0.338076  0.861238  0.220681
2013-01-03 -0.675398  0.067165  0.545052 -0.572764
2013-01-04  1.019432 -1.098247 -0.541578  1.987401
2013-01-05  2.173010  1.169701 -0.644824  0.222861
2013-01-06 -0.371800  0.293145  1.984087  0.542316

In [49]:
df.apply(np.cumsum)  #

                   A         B         C         D
2013-01-01 -0.535143  1.018789 -0.765626  0.656640
2013-01-02 -0.889628  0.680713  0.095613  0.877322
2013-01-03 -1.565026  0.747878  0.640665  0.304558
2013-01-04 -0.545594 -0.350369  0.099087  2.291959
2013-01-05  1.627416  0.819332 -0.545737  2.514820
2013-01-06  1.255616  1.112477  1.438350  3.057136

In [50]:
df.apply(lambda x:x.max() - x.min())

A    2.848408
B    2.267948
C    2.749713
D    2.560165
dtype: float64